app/controllers/carousel_controller.rb

        def add
            carousel = Carousel.new
            carousel.image = params[:image]
            carousel.title = params[:title]
            carousel.baseline = params[:baseline]
            carousel.color = params[:color]
            carousel.offset = params[:offset]
            carousel.restaurant_id = params[:id_restaurant]

            @restaurant_id = params[:id_restaurant]
            @saved = carousel.save
---
INSERT INTO "carousels" ("image", "title", "baseline", "restaurant_id", "created_at", "updated_at", "color") VALUES (?, ?, ?, ?, ?, ?, ?)

        def destroy
            carousel = Carousel.find params[:id_carousel]
            @restaurant_id = carousel.restaurant_id
            @destroyed = carousel.destroy
---
SELECT  "carousels".* FROM "carousels" WHERE "carousels"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "carousels" WHERE "carousels"."id" = ?  [["id", 3]]