app/controllers/opening_controller.rb

    def add
        open = Opening.new
        open.open_at = params[:open_at]
        open.close_at = params[:close_at]
        open.restaurant_id = params[:id_restaurant]

        @restaurant_id = params[:id_restaurant]
        @saved = open.save
---
INSERT INTO "openings" ("open_at", "close_at", "created_at", "updated_at", "restaurant_id") VALUES (?, ?, ?, ?, ?)  [["open_at", 18], ["close_at", 23], ["created_at", "2017-09-16 03:25:27.576371"], ["updated_at", "2017-09-16 03:25:27.576371"], ["restaurant_id", 3]]

    def destroy
        open = Opening.find params[:id_opening]
        @restaurant_id = open.restaurant_id
        @destroyed = open.destroy
---
SELECT  "openings".* FROM "openings" WHERE "openings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "openings" WHERE "openings"."id" = ?  [["id", 4]]