app/controllers/restaurant_controller.rb

SELECT  "restaurants".* FROM "restaurants" LIMIT ?  [["LIMIT", 5]]
---
    def home
        @restaurants = Restaurant.take 5

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."user_id" = ?  [["user_id", 1]]
---
    def list
        @id = current_user.id
        @restaurants = Restaurant.where(user_id: @id)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "carousels".* FROM "carousels" WHERE "carousels"."restaurant_id" = ?  [["restaurant_id", 1]]
SELECT "openings".* FROM "openings" WHERE "openings"."restaurant_id" = ?  [["restaurant_id", 3]]
---
    def show
        @restaurant = Restaurant.find params[:id_restaurant]

        @carousels = Carousel.where(restaurant_id: params[:id_restaurant])

        @openings = Opening.where(restaurant_id: params[:id_restaurant])

INSERT INTO "reservations" ("phone", "when", "person", "created_at", "updated_at", "restaurant_id") VALUES (?, ?, ?, ?, ?, ?)  [["phone", "0678374479"], ["when", "2017-09-15 11:00:00"], ["person", 0], ["created_at", "2017-09-16 01:26:50.566546"], ["updated_at", "2017-09-16 01:26:50.566546"], ["restaurant_id", 3]]
---
    def reservation
        res = Reservation.new
        res.when = DateTime.new(2017, Time.now.month, Time.now.day + params[:when_date].to_i, params[:when_hour].to_i, 0, 0)
        res.phone = params[:phone]
        res.person = params[:person].to_i
        res.restaurant_id = params[:id_restaurant].to_i
        @id = res.restaurant_id
        @result = res.save()

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "openings".* FROM "openings" WHERE "openings"."restaurant_id" = ?  [["restaurant_id", 3]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."restaurant_id" = ?  [["restaurant_id", 3]]
SELECT "carousels".* FROM "carousels" WHERE "carousels"."restaurant_id" = ?  [["restaurant_id", 7]]
---
    def form
        @isEdit = false
        if params[:id_restaurant]
            @isEdit = true
            @restaurant = Restaurant.find params[:id_restaurant]
            @openings = Opening.where(restaurant_id: params[:id_restaurant])
            @reservations = Reservation.where(restaurant_id: params[:id_restaurant])
            @carousel = Carousel.where(restaurant_id: params[:id_restaurant])

INSERT INTO "restaurants" ("name", "logo", "city", "zipcode", "address", "phone", "place", "created_at", "updated_at", "user_id", "menu") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        resto = Restaurant.new
        resto.name = params[:name]
        resto.logo = params[:logo]
        resto.city = params[:city]
        resto.zipcode = params[:zipcode]
        resto.address = params[:address]
        resto.phone = params[:phone]
        resto.place = params[:place]
        resto.menu = params[:menu]
        resto.user_id = current_user.id
        @saved = resto.save()

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 5]]
---
    def destroy
        resto = Restaurant.find params[:id_restaurant]
        if current_user.id == resto.user_id
            resto.destroy